Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: དངོས་པོ་མེད་པས་སྒྱུ་མ་ལྟ་བུའི་སེམས་སུ་སོང་བས་དངོས་པོ་མེད་པའི་སེམས་སུ་འགྱུར་རོ། །
en: Since they pursue the illusory mind knowing it is insubstantial, their mind is insubstantial.

source: ཕ་རོལ་གྱི་བདུད་ཐམས་ཅད་ཀྱི་རྒོལ་བ་ལ་གཡོ་བ་མེད་པས་བརྟན་པའི་སེམས་སུ་འགྱུར་རོ། །
en: Since they do not tremble before the hostility of all the māras who oppose them, their minds will remain steadfast.

source: བཞིན་བཟངས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མཉན་པ་ཙམ་གྱིས་བཟོད་པ་འདི་མང་དུ་བྱེད་ན་སྒོམ་པའི་རྣལ་འབྱོར་དང་ལྡན་པས་ལྟ་ཅི་སྨོས་ཏེ། ཚངས་པར་ཡོངས་སུ་རྫོགས་པ་ཤིན་ཏུ་སྒོམ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Respectable ones, if bodhisattvas amplify this acceptance only by hearing about it, what more needs to be said about those who take on the practice of cultivating it and those whose thorough cultivation of it has been completed and perfected!”

source: འདི་ལ་བསྟན་པ་སྟོན་པ་ན་སེམས་ཅན་བྲུག་གཡོས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ། །ཉན་ཐོས་ཀྱི་ཐེག་པ་དཔག་ཏུ་མེད་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དཔག་ཏུ་མེད་པ་ལ་སྐྱེས་པར་གྱུར་ཏོ། །
en: As this teaching was being delivered, myriads of beings gave rise to the mind set on unsurpassed and perfect awakening, and an innumerable number of them gave rise to the mind set on the vehicles of the hearers and the solitary buddhas.

source: དེ་ནས་གང་སྔོན་དེ་བཞིན་གཤེགས་པ་བཟོད་པའི་མཆོག་དཔལ་གྱི་ཕུང་པོའི་རྒྱལ་པོ་དེས། རྒྱལ་པོ་བསོད་ནམས་ཀྱི་འོད་ཟེར་དེ་ལ་མེ་ཏོག་བན་དུ་བསྐུར་བ་དེ་དག་ཅི་འདྲ་བར་གྱུར་ཅེས་སྲོག་ཆགས་མང་པོ་དེ་བཞིན་དུ་སེམས་དང་བསམ་པ་སྐྱེས་སོ། །
en: Many beings then wondered, “What kind of pentapetes flowers did the Thus-Gone One King of the Glorious Heap of Supreme Acceptance send to King Light Rays of Merit so long ago?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐུགས་ཀྱིས་སེམས་ཅན་དེ་དག་གི་སེམས་སོ་སོར་རྣམ་པར་རྟོག་པ་མཁྱེན་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། འཇམ་དཔལ་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཇི་ཙམ་པ་ལྷ་རྫས་ཀྱི་མིག་སྒྲིབ་པ་མེད་ཅིང་ཡེ་ཤེས་སྟོན་པས་མཐོང་ངམ།
en: Knowing every thought that had arisen in the minds of those beings, the Blessed One asked Mañjuśrīkumārabhūta, “Mañjuśrī, since your divine eye is unobstructed and you display such wisdom, can you see all the blessed buddhas of the eastern direction?

source: གང་ངས་སྔོན་རྒྱལ་པོ་བསོད་ནམས་འོད་ཟེར་གྱི་མཛོད་དུ་གྱུར་པས་བྱུང་སྟེ། ཀུན་ཏུ་རྒྱུའི་ཆ་བྱད་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: I was the one who appeared in the world as King Treasury of Light Rays of Merit so long ago and ripened beings while dressed as a parivrājaka.

source: ངས་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དུ་བཅུག་གོ། །
en: I led them to give rise to the mind set on unsurpassed and perfect awakening for the first time.

source: ངས་ཐམས་ཅད་ཀྱི་ཐོག་མར་སྦྱིན་པ་ནས་ཤེས་རབ་ཀྱི་བར་དུ་སྦྱོར་དུ་བཅུག་གོ། །
en: I also led them to practice generosity through insight for the very first time.”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཅིའི་རྐྱེན་གྱིས་ཀུན་ཏུ་འདྲི། བཀའ་སྩལ་པ།
en: Mañjuśrī replied, “Blessed One, why do you ask this question?”

source: འཇམ་དཔལ་མངོན་དུ་བྱ་བའི་ཕྱིར་རོ། །
en: “So that you can see for yourself, Mañjuśrī.”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་ལ་ཡང་བྱ་སླ་བའི་ཚད་གཟུང་དུ་མ་མཆིས་པ་ནི་འདི་ལྟ་སྟེ། འདི་དག་ནི་བརྒྱའོ། །འདི་དག་ནི་སྟོང་ངོ་། །འདི་དག་ནི་བྱེ་བའོ། །
en: Mañjuśrī then said, “Respected Blessed One, it is not easy at all to grasp their number!

source: འདི་དག་ནི་ཁྲིགས་ཁྲིགས་སོ། །འདི་དག་ནི་བཏང་ཡས་སོ། །འདི་དག་ནི་བྲུག་གཡོས་སོ། །འདི་དག་ནི་བྲུག་གཡོས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་སྟེ། ཤར་ཕྱོགས་ན་ད་ལྟར་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: There are a hundred, a thousand, ten million, a hundred million, a billion, a trillion, a sextillion blessed buddhas residing, offering sustenance, and teaching the Dharma to beings in the eastern direction.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་མ་དག་པ་དེར་བཞུགས་ཤིང་ཆོས་སྟོན་པ་ཁྱོད་ཀྱིས་གང་ཐམས་ཅད་ཀྱི་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དུ་བཅུག་གོ། །ཁྱོད་ཀྱིས་ཐམས་ཅད་ཀྱི་ཐོག་མར་སྦྱིན་པ་ནས་ཤེས་རབ་ཀྱི་བར་དུ་བཙུད་དོ། །
en: You caused those buddhas who reside and teach the Dharma in all those pure and impure buddha realms to give rise to the mind set on unsurpassed and perfect awakening for the very first time, and you led them to practice generosity through insight for the very first time.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་གི་ཕྱོགས་དང་། སྟེང་དང་། འོག་གི་ཕྱོགས་སུ་འདི་དག་ནི་ཁྲིམས་ཁྲིགས་ནས། ཐམས་ཅད་ཀྱི་ཐོག་མར་ཤེས་རབ་ལ་བཙུད་པའི་བར་དུ་ཅི་ལ་ཡང་བྱ་སླ་བའི་ཚད་གཟུང་མི་ནུས་སོ། །
en: Respected Blessed One, it is equally not possible to grasp with ease all the hundreds of millions of buddhas in the southern, western, or northern directions, or in the directions above and below, for whom you have done everything from straightening out their moral conduct to encouraging them to cultivate insight for the very first time!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་བཞིན་དུ་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་མ་དག་པ་ན་ཤེས་རབ་མངོན་དུ་བྱ་བའི་ཕྱིར་གང་ངས་ཐམས་ཅད་ཀྱི་ཐོག་མར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དུ་བཅུག་པ་དང་། བཙུད་པ་དང་། བཀོད་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ནི་ངས་ལྷ་རྫས་ཀྱི་མིག་གིས་མཐོང་ངོ་། །
en: “Mañjuśrī,” said the Blessed One, “my divine eye sees all the blessed buddhas in the pure and impure buddha realms of the eastern direction whom I encouraged and inspired to generate the mind set on awakening for the very first time, and whom I established in that attitude, so that they could actualize insight.

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་ཡོངས་སུ་དྲིས་པ་རྒྱལ་པོ་བསོད་ནམས་འོད་ཟེར་གྱི་མཛོད་ངས་ཀུན་ཏུ་རྒྱུའི་ཆ་བྱད་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་ཅི་ལ་ཡང་བྱ་སླ་བའི་ཚད་གཟུང་མི་ནུས་སོ། །
en: Mañjuśrī, you cannot easily grasp the number of beings that I, as that king Treasury of Light Rays of Merit, about whom you have asked, ripened while dressed as a parivrājaka.

source: ཡང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་ཡོངས་སུ་མ་དག་པ་ཐ་དད་པ་ན་ད་ལྟར་གྱི་སངས་རྒྱས་དེ་དག་བཞུགས་ཤིང་འཚོ་སྐྱོང་ངོ་། །
en: There are also present buddhas who reside in and offer sustenance in different pure and impure buddha realms of the ten directions.

source: གང་རྒྱལ་པོ་བསོད་ནམས་འོད་ཟེར་གྱི་མཛོད་ངས་ཀུན་ཏུ་རྒྱུའི་ཆ་བྱད་ཀྱིས་ཐམས་ཅད་ཀྱི་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡོངས་སུ་བཙུད་དོ། །
en: I, as King Treasury of Light Rays of Merit, inspired them to generate the mind set on unsurpassed and perfect awakening for the very first time, and I established them in that attitude, while dressed as a parivrājaka.

source: བཀོད་དོ། །དེ་བཞིན་དུ་སྦྱིན་པ་ནས་ཤེས་རབ་ཀྱི་བར་དུ་བཙུད་དོ། །
en: I also inspired them to cultivate everything from generosity to insight and established them in those practices.

source: བཀོད་པར་འགྱུར་རོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་སྔོན་བདག་གི་ཡོ་བྱད་ཤེས་པའི་རྗེས་སུ་དྲན་པར་འགྱུར་བས་ཇི་ལྟར་འཁོར་ཐམས་ཅད་དང་ལྡན་པ་མངོན་སུམ་དུ་འགྱུར་ན་སངས་རྒྱས་རེ་རེས་ཀྱང་བདག་ལ་མེ་ཏོག་བན་དུ་བསྐུར་ཅིག །
en: May all those blessed buddhas remember my past attributes and appear before this whole assembly, and may each of them send me pentapetes flowers!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚིག་འདི་བཤད་མ་ཐག་ཏུ་ཕྱོགས་བཅུ་ཇི་ཙམ་པ་ནས་ནམ་མཁའ་ལ་མེ་ཏོག་དམར་པོ་ཡང་མ་ཡིན་མི་དམར་བ་ཡང་མ་ཡིན་པའི་སྤྲིན་ཆེན་པོ་འོངས་པ་མཐོང་ནས།
en: As soon as the Blessed One had said those words, the beings gathered in the assembly saw great clouds of flowers in the sky that were neither red nor white, coming from all the ten directions.

source: སྐྱེ་བོའི་ཚོགས་ཆེན་པོའི་ངོ་མཚར་དེ་ལྟ་བུ་འབྱུང་བ་འདི་ཅིར་འགྱུར་ཞེས་བྱས་པ་དང་།
en: The crowd wondered, “What will happen now that a great marvel such as this has occurred?”

source: དེ་ནས་མེ་ཏོག་གི་ཆར་འབབ་པར་ཡང་དག་པར་བརྩམས་ནས།
en: Showers of flowers then started to fall.

source: མེ་ཏོག་དམར་པོ་ཡང་མ་ཡིན།
en: The flowers appeared to be neither red nor white.

source: དཀར་པོ་ཡང་མ་ཡིན་པར་སྣང་བ་མཆོག་ཏུ་ཤིན་ཏུ་འཇམ་པ་མཉེན་པ་ཀ་ཙ་ལིན་ད་ལྟ་བུས་ཀུན་ཏུ་རེག་པ།
en: They were extremely smooth and soft to the touch like silk.

source: བུང་བ་དང་། ཀིང་ཤུ་ཀ་ལྟ་བུའི་ཁ་དོག་གི་མེ་ཏོག་གི་ཆར་དེ་དག་གླིང་བཞི་པར་མ་ལུས་པར་རབ་ཏུ་བབ་པོ། །སྐྱེས་བུའི་ཚད་ཙམ་དུས་ཐམས་ཅད་ཁེབས་སོ། །
en: The rain of flowers the color of bees and kiṃśuka blossoms fell across all four continents and covered everything up to the height of a person.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བཞིན་བཟངས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཐ་མི་དད་པ་ན་མེ་ཏོག་བན་དུ་ཇི་ཙམ་པ་དེ་ཙམ་གྱིས་ད་ལྟར་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་ཆོས་ཀྱང་འཆད་དོ། །
en: The Blessed One then said, “Respectable ones, there are as many blessed buddhas who now reside, offer sustenance, and teach the Dharma in the different buddha realms of the ten directions as there are all those pentapetes flowers.

source: དེའི་ཚེ་རྒྱལ་པོ་བསོད་ནམས་འོད་ཟེར་གྱི་མཛོད་ངས་ཀུན་ཏུ་རྒྱུའི་ཆ་བྱད་ཀྱིས་ཐམས་ཅད་ཀྱི་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དུ་བཅུག་གོ། །
en: At that time, I, as King Treasury of Light Rays of Merit, led them to give rise to the mind set on unsurpassed and perfect awakening for the very first time while dressed as a parivrājaka.

source: ངས་ཐམས་ཅད་ཀྱི་ཐོག་མར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་ཡང་དག་པར་བཞག་གོ། །བཙུད་དོ། །བཀོད་དོ། །
en: I also established them, encouraged them, and placed them in the perfections from generosity to insight for the very first time.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ད་ལྟར་སྔོན་གྱི་ཆོ་ག་ཤེས་པའི་རྗེས་སུ་དྲན་པས་སངས་རྒྱས་རེ་རེས་ཀྱང་མེ་ཏོག་བན་དུ་རེ་རེ་བདག་ལ་བསྐུར་རོ། །
en: All those blessed buddhas now remember their former brahmin priest, and each of them has sent me one of those pentapetes flowers.

source: ཁྱེད་ཅག་ཐམས་ཅད་མངོན་སུམ་དུ་གྱུར་པར་གྱུར་ནས་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་དེ་འདི་སྒོམས་ཤིག །
en: Now that you have all witnessed this directly, cultivate this acceptance of taming beings with the sky-colored method of perfect conduct!

source: བཟོད་པ་འདིའི་མཐུས་གང་འདས་པའི་དུས་ན་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐ་དད་པར་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་པ།
en: “In the past, through the power of this acceptance, the bodhisattvas in different buddha realms of the ten directions have awakened to unsurpassed and perfect buddhahood.

source: སེམས་ཅན་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ། སངས་རྒྱས་ཀྱི་དགོས་པ་ཀུན་ཟད་པར་བྱས་པ།
en: They turned the wheel of the Dharma for beings, fulfilled all the purposes of a buddha, and settled into the realm of nirvāṇa that is without origination.

source: འབྱུང་བ་མེད་པ། མྱ་ངན་ལས་འདའ་བའི་ཁམས་ན་འདུག་པ། མེ་ཏོག་བན་དུའི་ཆར་འདི་དག་ཇི་ཙམ་པ་འདི་ཙམ་གྱི་སེམས་ཅན་ངས་ཚེ་གཅིག་གིས་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: I ripened as many beings in a single lifetime as all the pentapetes flowers that fell in rain showers.

source: འདས་པའི་དུས་ན་མེ་ཏོག་བན་དུའི་ཆར་འདི་དག་ཇི་ཙམ་པ་དེ་ཙམ་གྱི་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དག་དེའི་ཚེ་གང་རྒྱལ་པོ་བསོད་ནམས་འོད་ཟེར་གྱི་མཛོད་ངས་ཐམས་ཅད་ཀྱི་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དུ་བཅུག་གོ། །
en: In the past, when I was King Treasury of Light Rays of Merit, I caused as many bodhisattvas as there are pentapetes flowers in rain showers, who would later awaken to unsurpassed and perfect buddhahood, to give rise to the aspiration for unsurpassed and perfect awakening for the very first time.

source: ངས་ཐམས་ཅད་ཀྱི་ཐོག་མར་སྦྱིན་པ་ལ་སྦྱོར་བར་བྱེད་ཅིང་བཀོད་པ་ནས་ཤེས་རབ་ཀྱི་བར་དུ་སྦྱོར་བར་བྱེད་ཅིང་བཀོད་དོ། །
en: I did everything from causing them to practice and establishing them in generosity for the first time to causing them to practice and establishing them in insight.

source: བཞིན་བཟངས་མཐུ་ཆེན་པོ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་འདི་ལྟོས་ཤིག །
en: Respectable ones, look at the great power of this acceptance of taming beings with the sky-colored method of perfect conduct!

source: རིགས་ཀྱི་བུ་ཕོ་དང་རིགས་ཀྱི་བུ་མོ་བྱང་ཆུབ་འདོད་པ་རྣམས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་འདི་བསྒོམ་པར་བྱ་བ་འདི་ལ་ཚུལ་བཞིན་དུ་བྱའོ། །
en: The noble sons and daughters who wish for awakening and want to swiftly awaken to unsurpassed and perfect buddhahood should genuinely cultivate this acceptance of taming beings with the sky-colored method of perfect conduct!”

source: ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ལེའུ་བཅུ་པའོ།། །།བམ་པོ་བཅུ་པ།
en: This was the tenth chapter of the Great Vehicle sūtra entitled “The Acceptance That Tames Beings with the Sky-Colored Method of Perfect Conduct.”

source: དེ་ནས་ཀུན་ཏུ་རྒྱུ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་འོད་ཟེར་འཆང་བ་ཞེས་བྱ་བ་དེ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ཤིན་ཏུ་རྐང་གཉིས་མཆོག་གིས་བདེ་བྱིན་པ། །ལྟ་བ་ལོག་ཞུགས་འགྲོ་ལ་སྒྲོན་མ་འཛིན། །ཆོས་ཀྱི་འཁོར་ལོ་དག་གི་སྒྲ་འཇུག་པ། །ཇི་ལྟར་ལྟ་བའི་དྲ་བ་མངོན་འཆད་འགྱུར། །
en: Chapter 11 Then, the parivrājaka named Holder of Manifold Light Rays prostrated to the Blessed One with his palms together and addressed these verses to the Blessed One: “Supreme human, you bestow happiness, You hold the torch for beings with mistaken views, And you initiate the sound of the Dharma’s wheels In a way that severs the net of wrong views.

source: དྲི་མ་གསུམ་སྤངས་མིག་གསུམ་གཏོང་ཕོད་པ། །ཆོས་ཀྱིས་འགྲོ་བ་ཐམས་ཅད་ཚིམ་མཛད་པ། །
en: “Having abandoned the three stains, you can bestow the three eyes, And you satisfy all beings with the Dharma.

source: ཁམས་གསུམ་འགྲོ་བ་ལ་ནི་སྒྲོན་འཛིན་པ། །ཇི་ལྟར་ལྟ་བའི་དྲ་བ་སྲབ་པར་འགྱུར། །
en: You hold the torch for beings in the three realms And tear down the net of wrong views.

source: འགྲོ་བ་དག་ལ་གསེར་དང་ཟླ་བ་བཞིན། །སྤྱན་ནི་རབ་མཛེས་ཤིན་ཏུ་གསལ་བའི་ཞལ། །བཟོད་པ་ཇི་ལྟར་ཐོབ་པའི་སྤྱོད་པ་གསུངས། །ཇི་ལྟར་ལྟ་བའི་རྒྱུ་རྣམས་འཇིག་པར་འགྱུར། །
en: “You are like gold and the moon to beings, Your eyes are beautiful and your face resplendent, And you teach the conduct that leads to attaining acceptance And eradicating the roots of all wrong views.

source: སེམས་ཅན་འགྲོ་བ་སྡིག་པ་ལས་ཟློག་མཛད། སྡིག་པའི་བསམ་བྲལ་ལྟ་བ་དགེ་བ་ལ། །ཚེ་ཡི་ཆུ་བོ་སྡིག་པ་སེལ་འགྱུར་བ། །སྡིག་པའི་ལྟ་གསུམ་ཇི་ལྟར་ཐར་བར་བྱེད། །
en: “You turn beings away from negative paths, You free them from negative thoughts, you establish them in virtuous views, You eliminate the misdeeds from the streams of their lives, And you free them from the three types of unwholesome views.

source: དྲང་སྲོང་ཆེན་པོ་དབང་པོ་ཐམས་ཅད་བསྡམས། །
en: “Great Sage, your senses are restrained.

source: དད་པས་མོས་པ་ལྟར་ན་གཞན་ལ་གནས། །རྣམ་པར་སྤྱོད་བཅས་རྩ་བ་ཤིན་སྤང་ཕྱིར། །ལྟ་བའི་མདུད་ཡོང་ཇི་ལྟར་ཟད་པར་འགྱུར། །
en: You dwell among others like a faithful devotee So that they will abandon the roots of their conduct And you loosen the knot of wrong views.

source: ཐམས་ཅད་འགྲོ་ལ་ཁྱོད་ནི་བློ་གྲོས་ཅན། །མཆོག་གི་བཟོད་པ་དག་གི་ལམ་སྟོན་པ། །བསམ་པ་ཐམས་ཅད་ཀྱིས་ནི་འགྲོ་འདི་མགུ། །སྡིག་པར་ལྟ་བ་ཇི་ལྟར་འཇིག་པར་འགྱུར། །
en: “Wisest among all beings, You teach the path of the supreme acceptances, And all your thoughts please beings And annihilate unwholesome views.

source: འཕགས་པའི་རྒྱལ་པོ་ཉོན་མོངས་དགྲ་སྲེག་པ། །ལམ་གྱི་ཡན་ལག་བརྒྱད་ནི་ཉེ་བར་སྟོན། །
en: “King of the noble ones, you burn away the enemies—the afflictions— And you teach the eightfold path.

source: འགྲོ་ལ་ལྷ་དང་ཟླ་བ་ཀུན་སྤངས་པ། །ལྟ་བའི་མུན་པ་དག་པར་ཇི་ལྟར་འགྱུར། །
en: You are like a god and the moon to beings, great renunciant, And you clear away the darkness of their views.

source: མི་འདུལ་ཁ་ལོ་སྒྱུར་ཞིང་ཐུགས་རབ་དགྱེས། །མི་མཆོག་རྒྱལ་པོ་འགྲོ་ལ་བཀྲ་ཤིས་མཛད། །ལྟ་བ་དགེ་ལ་འགྲོ་བ་འཇུག་པ་མེད། །སྡིག་པ་ལྟ་ལ་གང་དག་རྒྱུན་གཅོད་མེད། །
en: “Trainer who tames human beings and brings delight, Supreme human, king, bringer of good fortune, Beings who do not adopt virtuous views Do not put an end to their unwholesome views.

source: བདེ་གཤེགས་འདུལ་དང་བཟོད་དང་སྡོམ་ལ་དགྱེས། །
en: “Well-Gone One, you delight in discipline, patience, and restraint.

source: འགྲོ་བའི་ཐེ་ཙོམ་སྣ་ཚོགས་དེ་གཟིགས་ཏེ། །ཟླ་བར་གྱུར་པའི་ཆོས་ཀྱི་ཟླ་བ་བྱིན། །སྡིག་པའི་ལྟ་ཀུན་ཇི་བཞིན་འགྱུར་བ་མེད། །
en: You see the various doubts of beings, Offer them the moon of the Dharma that is the true moon, And it is as if all their unwholesome views cease to exist.

source: གཅིག་ཏུ་སྤྱད་པ་རྟག་ཏུ་བསམ་གཏན་དགྱེས། །དེ་བཞིན་འདིར་གནས་དཔག་མེད་འཁོར་དག་ལ། །སྡིག་པའི་ལྟ་བ་ཇི་ལྟར་ཡང་རེག་མེད། །ཆགས་མེད་རྒྱལ་མཚན་དོན་འདི་བཤད་དུ་གསོལ། །
en: “Being singular in conduct and always delighting in concentration, Please explain to all the countless beings present here in this assembly The meaning of the victory banner of being unattached And having no contact with unwholesome views such as those.

source: འཁོར་བའི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་མཛད། །བཱ་རཱ་ཎ་སཱིར་དགེ་བའི་འཁོར་ལོ་བསྐོར། །སྲོག་ཆགས་བྱེ་མང་ལྟ་ལས་ཐར་མཛད་པ། །
en: “You completely pacified the suffering of saṃsāra, You turned the virtuous wheel in Vārāṇasī, And you have liberated many millions of beings from wrong views.

source: ལྟ་བར་སོང་བ་ཐར་མཛད་ཆོས་གསུངས་གསོལ། །
en: Please teach us the Dharma that liberates from mistaken views!

source: ལྟ་བ་སྤྱོད་ཅིང་སྡིག་པའི་བློ་གྲོས་ཅན། །སྲོག་ཆགས་བྱེ་སྟོང་ཕྲག་བཅུ་འདི་དག་གནས། །
en: “There are hundreds of billions of beings living here Whose intellects are corrupted and who put wrong views into practice.

source: སྡིག་ལྟ་ཀུན་ཇི་བཞིན་འགྱུར་མེད་པ། །བདེ་གཤེགས་ཡོངས་སུ་བསྔོ་བ་ཇི་ལྟར་འགྱུར། །
en: Well-Gone One, please dedicate those teachings So that all their unwholesome views cease to exist!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་རང་བཞིན་ཅན་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་གང་གི་ཚེ་བསྐལ་པ་ཚད་མེད་པ་ལས་ཤིན་ཏུ་འདས་པར་སྟོན་པ་དེའི་ཚེ་དེའི་དུས་ན་ལྷོ་ཕྱོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་ཉི་ཤུ་ལས་ཤིན་ཏུ་འདས་པ་དེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་བློ་གྲོས་དབྱངས་ཞེས་བྱ་བ་རྙོག་པ་ལྔས་ཤིན་ཏུ་གང་ཞིང་ལྟ་བ་ཐ་དད་པར་སོང་བ་དོག་པ་རྙེད་པར་གྱུར་ཅིང་།
en: The Blessed One then said to the bodhisattva Nature of Space, “Noble son, during the time of the teacher who lived countless eons ago past twenty thousand buddha realms in the southern direction, there was a buddha realm called Melody of the Intellect that was inundated with the five impurities.

source: སེམས་ཅན་ཀུན་ཏུ་གཟིར་བར་གྱུར་པ་དེ་ལ་དེའི་ཚེ་དེའི་དུས་ན།
en: The beings there had found impassible paths related to different wrong views and suffered great torment.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོ་ཞེས་བྱ་བ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་གྱུར་པ་དེའི་སྟོང་གསུམ་གྱི་ཉན་ཐོས་ཀྱི་ཚོགས་འདུས་པ་ཆེན་པོར་གྱུར་པ་དྲན་ནམ།
en: At that time lived a blessed thus-gone one called Lord of the Brahmā Realm. Do you remember the great assembly of three thousand hearers of that worthy, perfect buddha?

source: ཇི་ལྟར་ད་ལྟར་རྒྱལ་པོ་འབི་འབི་ས་ར་ངའི་ཡོན་བདག་ཆེན་པོ་ཡིན་པས་དེ་ན་ང་འོད་འཛིན་པའི་རྒྱལ་པོ་ཆེན་པོར་གྱུར་ཅིང་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོར་ཡང་གྱུར་ཏོ། །
en: Just as King Bimbisāra is my great benefactor today, I was the great king Light Holder at that time, and I was the benefactor of the Thus-Gone One Lord of the Brahmā Realm.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོ་འཁོར་དང་བཅས་པ་ལ་དེ་ལྟར་བདག་ཉི་མ་རེ་རེ་ཞིང་ཡང་མེ་ཏོག་སྣ་ཚོགས་དང་། དྲི་སྣ་ཚོགས་དང་། རིན་པོ་ཆེའི་གདུགས་སྣ་ཚོགས་དང་། རོལ་མོ་སྣ་ཚོགས་ཀྱིས་མཆོད་པ་བྱས་སོ། །
en: Each day, I worshiped the Thus-Gone One Lord of the Brahmā Realm and his retinue with various offerings of flowers, perfumes, jeweled parasols, and music.

source: ཡང་བཅོམ་ལྡན་འདས་དེ་ལ་དེ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པས་ཟླ་བ་གསུམ་དུ་ཡོ་བྱད་ཀྱིས་སྤྱན་དྲངས་ཏེ།
en: I hosted that blessed one and his saṅgha of hearers and provided them with provisions for three months.

source: ལམ་སྲང་གང་ན་མི་ཡོད་པ་དག་ཁ་ན་མ་ཐོ་བ་མེད་པའི་སྟོན་པ་བྱའོ་ཞེས་ལམ་སྲང་དུ་སྒྲ་འབྱིན་དུ་ཡང་བཅུག་གོ། །
en: I issued this proclamation on the road: ‘All people present on the road must demonstrate faultless conduct.’

source: ལམ་སྲང་དེ་ན་བྲམ་ཟེ་གང་གཱ་ཞེས་བྱ་བ་ཉི་མ་ལ་དད་པ་ཅན་དུ་གྱུར་པ་རྐང་པ་གཅིག་གིས་ཉི་མ་ལ་དགའ་ཞིང་ཉིན་མཚན་སྟོན་པ་ན་མངོན་པར་ཤེས་པ་དེ་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་འགྲོ་བར་མི་འདོད་ནས། དེ་ངས་སྦྲན་པར་བྱས་སོ། །
en: “I knew that there was a brahmin named Gaṅga on that road who was a devotee of the sun and expressed his devotion to the sun by standing on one leg. He performed this conduct day and night and did not want to take refuge in the Blessed One, so I summoned him.

source: བྲམ་ཟེ་འདིས་ངའི་བྱ་བ་ལ་ནན་ཏན་དུ་མ་བྱས་པས་ཉི་མ་བདུན་དུ་མཆོག་ཏུ་གནོད་པས་གཙེའོ་ཞེས་བྱས་ནས་རྒྱལ་པོའི་ཞམ་རིང་བས་བཟུང་སྟེ་བཙོན་རར་བཅུག་པ་དང་།
en: Since that brahmin did not follow my command, I declared that he should be punished with severe forms of torture for seven days. My attendants caught him and threw him into jail.

source: བྲམ་ཟེ་དེས་རྟག་ཏུ་ཉིན་མཚན་བདུན་དུ་འདི་ལྟ་བུའི་སྨོན་ལམ་བཏབ། །གལ་ཏེ་དེ་བཞིན་དུ་ཚངས་པའི་དབང་པོ་མགོ་རེག་སྣམ་བུ་དམར་པོ་ཅན་ཐམས་ཅད་ཤེས་པར་འགྱུར་བ་དེ་སྦེད་པའི་གནས་འདིར་བདག་གི་གན་དུ་ཤོག་ཤིག །
en: For seven days and nights, that brahmin continuously made this aspiration: ‘May this Lord of the Brahmā Realm, who is renowned among all the monks with shaved heads and wearing red robes, come to me in this hidden place!

source: དེའི་འོག་ཏུ་ཉི་མ་ཐམས་ཅད་ཤེས་པར་གྱུར་པ་གང་བདག་བཙོན་ར་ནས་ཐར་བར་བྱེད་པ་དེ་བཙོན་ར་འདིར་ཞུགས་ཤིང་གང་གི་མཐུས་བདག་འཚོ་བ་རྙིད་པ་དེ་ལ་བདག་སྐྱབས་སུ་འགྲོའོ། །
en: Then, if he enters this jail and frees me from prison along with everyone who is known to be a devotee of the sun, then I will take refuge in the one who saved my life through that power!’

source: དེ་ནས་ཉིན་མཚན་བདུན་པའི་ཐ་མ་འདས་པ་ན་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོའི་གཡས་ཕྱོགས་ན་ནི་ཉི་མའི་ལྷའི་བུ་ཕྱག་འཚལ་ཞིང་འདུག །
en: “In the morning, after seven days and nights had passed, the blessed thus-gone one Lord of the Brahmā Realm entered his jail.

source: གཡོན་ཕྱོགས་ན་ནི་ཟླ་བའི་ལྷའི་བུ་ཕྱག་འཚལ་ཞིང་འདུག །མདུན་ནི་བརྒྱ་བྱིན་དང་།
en: The gods of the sun and the moon were sitting on his right and left sides, paying homage to him.

source: ཚངས་པ་ཕྱག་འཚལ་ཞིང་འདུག་པ་བཙོན་རར་བཞུད་ནས་དེ་བཞིན་གཤེགས་པ་དེས་བྲམ་ཟེ་ཉི་མ་ལ་དད་པ་ཅན་ལ་བཀའ་སྩལ་པ།
en: Śakra and Brahmā were also sitting in front of him, paying homage to him.

source: བྲམ་ཟེ་ང་ནི་མིར་གྱུར་པ་ཐམས་ཅད་ཀྱིས་ཤེས་པའོ། །
en: The Thus-Gone One said to the brahmin who was devoted to the sun, ‘Brahmin, I am renowned among all humans.

source: ཐམས་ཅད་ལ་སྟོན་པའོ། །ལྷ་ཐམས་ཅད་ཀྱིས་ཡིད་ལ་བྱེད་པའོ། །
en: I teach all of them, and all the gods have their attention focused upon me.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་ཤིང་སྙིང་རྗེ་བའོ། །འཁོར་བའི་བཙོན་ར་དང་རྒ་ཤི་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་པའོ། །
en: I manifest love and compassion for all beings, and I liberate everyone from the prison of saṃsāra and from old age and death.

source: བྲམ་ཟེ་ལྟ་བ་ལོག་པའི་རྒྱུན་ཆོད་ཅིག །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་ཐོབ་ཤིག་ཆོས་ཀྱི་རོས་སེམས་ཅན་ཐམས་ཅད་བོས་ཤིག །
en: Brahmin, get rid of your mistaken views, make aspirations to reach unsurpassed and perfect awakening, and summon all beings with the taste of the Dharma!

source: ལྷ་དང་། མི་དང་། སྐྱེ་དགུའི་ནང་ན་སེམས་ཅན་ལྟ་བ་དོག་པ་རྙེད་པ་རྣམས་ཡོངས་སུ་ཐར་བར་བྱོས་ཤིག །
en: Liberate gods, humans, and other living beings who have acquired dangerous views!’

source: དེ་ནས་བྲམ་ཟེ་དེ་དགའ་མགུ་ཡིད་བདེ་བ་སྐྱེས་ནས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོའི་ཞབས་གཉིས་ཀྱི་དྲུང་དུ་འོངས་ནས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་སྡིག་པའི་ལྟ་བར་སོང་བའི་ནོངས་པ་སྤངས་ཏེ། བཅོམ་ལྡན་འདས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་བདག་ནི་འདི་ལྟར་སྐྱབས་སུ་མཆིའོ། །
en: “Filled with joy, delight, and pleasure, the brahmin then prostrated to the feet of the Thus-Gone One Lord of the Brahmā Realm and exclaimed, ‘Respected Blessed One, I give up the error of following unwholesome, mistaken views, and I take refuge in the Blessed One, the Dharma, and the Saṅgha!’

source: དེ་བཞིན་གཤེགས་པས་བཀའ་སྩལ་པ། བྲམ་ཟེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཁྱོད་ཀྱིས་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་ལེགས་སོ་ལེགས་སོ། །
en: “The Blessed One replied, ‘Brahmin, it is excellent, truly excellent, that you have perfected all your thoughts for unsurpassed and perfect awakening!
